/**
 * ============================================================================================================================================================
 * 👉 전역으로 사용할 컴포넌트 등록
 * -> app component install 함으로서 각 컴포넌트에서 import 필요 없음
 * -> 네이밍 규칙 : i-xxx
 * -> 개별 컴포넌트에서 <i-xxx></i-xxx>로 HTML 태그 사용
 * ============================================================================================================================================================
 */

import EChart from '@/components/echart/ECharts.vue'

export default {
  install: (app) => {
    app.component('e-chart', EChart)
  },
}
